{"class_name": "Model", "config": {"name": "model_81", "layers": [{"name": "input_55", "class_name": "InputLayer", "config": {"batch_input_shape": [100, 56], "dtype": "float32", "sparse": false, "name": "input_55"}, "inbound_nodes": []}, {"name": "dense_252", "class_name": "Dense", "config": {"name": "dense_252", "trainable": true, "batch_input_shape": [null, 100, 56], "dtype": "float32", "units": 250, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_55", 0, 0, {}]]]}, {"name": "dropout_56", "class_name": "Dropout", "config": {"name": "dropout_56", "trainable": true, "dtype": "float32", "rate": 0.7, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_252", 0, 0, {}]]]}, {"name": "dense_253", "class_name": "Dense", "config": {"name": "dense_253", "trainable": true, "dtype": "float32", "units": 250, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_56", 0, 0, {}]]]}, {"name": "batch_normalization_28", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_28", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dense_253", 0, 0, {}]]]}, {"name": "dense_254", "class_name": "Dense", "config": {"name": "dense_254", "trainable": true, "dtype": "float32", "units": 250, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "dense_255", "class_name": "Dense", "config": {"name": "dense_255", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_254", 0, 0, {}]]]}, {"name": "dense_256", "class_name": "Dense", "config": {"name": "dense_256", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_254", 0, 0, {}]]]}, {"name": "lambda_28", "class_name": "Lambda", "config": {"name": "lambda_28", "trainable": true, "dtype": "float32", "function": "_sampling", "function_type": "function", "output_shape": [2], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_255", 0, 0, {}], ["dense_256", 0, 0, {}]]]}, {"name": "dense_257", "class_name": "Dense", "config": {"name": "dense_257", "trainable": true, "dtype": "float32", "units": 250, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_28", 0, 0, {}]]]}, {"name": "dense_258", "class_name": "Dense", "config": {"name": "dense_258", "trainable": true, "dtype": "float32", "units": 250, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_257", 0, 0, {}]]]}, {"name": "dropout_57", "class_name": "Dropout", "config": {"name": "dropout_57", "trainable": true, "dtype": "float32", "rate": 0.7, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_258", 0, 0, {}]]]}, {"name": "dense_259", "class_name": "Dense", "config": {"name": "dense_259", "trainable": true, "dtype": "float32", "units": 250, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_57", 0, 0, {}]]]}, {"name": "dense_260", "class_name": "Dense", "config": {"name": "dense_260", "trainable": true, "dtype": "float32", "units": 56, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_259", 0, 0, {}]]]}], "input_layers": [["input_55", 0, 0]], "output_layers": [["dense_260", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}